In [1]:
import pandas as pd

In [16]:
df = pd.read_csv("us_babynames/us_babynames_by_year/yob2014.csv",header=None)

In [17]:
df

              0  1      2
0          Emma  F  20799
1        Olivia  F  19674
2        Sophia  F  18490
3      Isabella  F  16950
4           Ava  F  15586
...         ... ..    ...
33039    Zykeem  M      5
33040    Zymeer  M      5
33041   Zymiere  M      5
33042     Zyran  M      5
33043     Zyrin  M      5

[33044 rows x 3 columns]

In [10]:
len(df[df[1]=="F"])

19067

In [11]:
df = pd.read_csv("us_babynames/us_babynames_test/yob2012short.csv",header=None)
df

          0  1   2
0    Sophia  F  10
1      Emma  F   9
2  Isabella  F   8
3    Olivia  F   7
4       Ava  F   6
5     Jacob  M   8
6     Mason  M   7
7     Ethan  M   7
8      Noah  M   6
9   William  M   5